Tekla.Structures.Internal.RemotingProxyFactory.InitializeLifetimeService


Tekla.Structures.Internal.RemotingProxyFactory.Default
Singleton instance of the factory.

Tekla.Structures.Internal.RemotingProxyFactory.UseInDomain(System.AppDomain)
Use this factory instance in the given domain to alter the behavior of the
domain's Tekla.Structures.Internal.RemotingProxyHelper.CreateNewInstance``2(System.String) method.
Same factory instance can be used in multiple domains.
domain: The domain in which the remoting proxy factory should be set.